orgp/student_intervention_revisit.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Supervised Learning: Building a Student Intervention System</title>
<!-- 2017-06-17 Sat 19:50 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Robert M Salom" />
</head>
<body>
<div id="content">
<h1 class="title">Supervised Learning: Building a Student Intervention System</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Obective</h2>
<div class="outline-text-2" id="text-1">
<p>
The goal of this project is to identify students who might need early intervention. We want to predict whether a given student will pass or fail
based on information about his life and habits. Therefore we approach this task as a classification problem with two classes, pass and fail.
</p>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Dataset</h2>
<div class="outline-text-2" id="text-2">
<p>
In what follows we will be working with part of the <a href="https://archive.ics.uci.edu/ml/datasets/student+performance">Student Performance Data Set</a> from the UCI machine learning repository. It is composed of
395 data points with 30 attributes each. The 31&rsquo;st attribute indicates whether the student passed or failed. Here is a brief description of
each feature:
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Attributes for student-data.csv:</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>school - student&rsquo;s school (binary: &ldquo;GP&rdquo; or &ldquo;MS&rdquo;)
</li>
<li>sex - student&rsquo;s sex (binary: &ldquo;F&rdquo; - female or &ldquo;M&rdquo; - male)
</li>
<li>age - student&rsquo;s age (numeric: from 15 to 22)
</li>
<li>address - student&rsquo;s home address type (binary: &ldquo;U&rdquo; - urban or &ldquo;R&rdquo; - rural)
</li>
<li>famsize - family size (binary: &ldquo;LE3&rdquo; - less or equal to 3 or &ldquo;GT3&rdquo; - greater than 3)
</li>
<li>Pstatus - parent&rsquo;s cohabitation status (binary: &ldquo;T&rdquo; - living together or &ldquo;A&rdquo; - apart)
</li>
<li>Medu - mother&rsquo;s education (numeric: 0 - none, 1 - primary education (4th grade), 2 – 5th to 9th grade, 3 – secondary education or 4 – higher education)
</li>
<li>Fedu - father&rsquo;s education (numeric: 0 - none, 1 - primary education (4th grade), 2 – 5th to 9th grade, 3 – secondary education or 4 – higher education)
</li>
<li>Mjob - mother&rsquo;s job (nominal: &ldquo;teacher&rdquo;, &ldquo;health&rdquo; care related, civil &ldquo;services&rdquo; (e.g. administrative or police), &ldquo;at_home&rdquo; or &ldquo;other&rdquo;)
</li>
<li>Fjob - father&rsquo;s job (nominal: &ldquo;teacher&rdquo;, &ldquo;health&rdquo; care related, civil &ldquo;services&rdquo; (e.g. administrative or police), &ldquo;at_home&rdquo; or &ldquo;other&rdquo;)
</li>
<li>reason - reason to choose this school (nominal: close to &ldquo;home&rdquo;, school &ldquo;reputation&rdquo;, &ldquo;course&rdquo; preference or &ldquo;other&rdquo;)
</li>
<li>guardian - student&rsquo;s guardian (nominal: &ldquo;mother&rdquo;, &ldquo;father&rdquo; or &ldquo;other&rdquo;)
</li>
<li>traveltime - home to school travel time (numeric: 1 - &lt;15 min., 2 - 15 to 30 min., 3 - 30 min. to 1 hour, or 4 - &gt;1 hour)
</li>
<li>studytime - weekly study time (numeric: 1 - &lt;2 hours, 2 - 2 to 5 hours, 3 - 5 to 10 hours, or 4 - &gt;10 hours)
</li>
<li>failures - number of past class failures (numeric: n if 1&lt;=n&lt;3, else 4)
</li>
<li>schoolsup - extra educational support (binary: yes or no)
</li>
<li>famsup - family educational support (binary: yes or no)
</li>
<li>paid - extra paid classes within the course subject (Math or Portuguese) (binary: yes or no)
</li>
<li>activities - extra-curricular activities (binary: yes or no)
</li>
<li>nursery - attended nursery school (binary: yes or no)
</li>
<li>higher - wants to take higher education (binary: yes or no)
</li>
<li>internet - Internet access at home (binary: yes or no)
</li>
<li>romantic - with a romantic relationship (binary: yes or no)
</li>
<li>famrel - quality of family relationships (numeric: from 1 - very bad to 5 - excellent)
</li>
<li>freetime - free time after school (numeric: from 1 - very low to 5 - very high)
</li>
<li>goout - going out with friends (numeric: from 1 - very low to 5 - very high)
</li>
<li>Dalc - workday alcohol consumption (numeric: from 1 - very low to 5 - very high)
</li>
<li>Walc - weekend alcohol consumption (numeric: from 1 - very low to 5 - very high)
</li>
<li>health - current health status (numeric: from 1 - very bad to 5 - very good)
</li>
<li>absences - number of school absences (numeric: from 0 to 93)
</li>
<li>passed - did the student pass the final exam (binary: yes or no)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Loading the data</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Imports</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
The following python libraries are used in this analysis.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900; font-weight: bold;">import</span> numpy <span style="color: #859900; font-weight: bold;">as</span> np
<span style="color: #859900; font-weight: bold;">import</span> pandas <span style="color: #859900; font-weight: bold;">as</span> pd
<span style="color: #859900; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #859900; font-weight: bold;">as</span> plt
<span style="color: #859900; font-weight: bold;">from</span> tabulate <span style="color: #859900; font-weight: bold;">import</span> tabulate
<span style="color: #859900; font-weight: bold;">import</span> pickle
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Pre-process</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Let us first observe what the graduation rate is for the class;
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #268bd2;">student_data</span> = pd.read_csv(<span style="color: #2aa198;">"student-data.csv"</span>)

<span style="color: #268bd2;">n_students</span> = student_data.shape[0]
<span style="color: #268bd2;">n_features</span> = student_data.shape[1] - 1
<span style="color: #268bd2;">n_passed</span> = <span style="color: #657b83; font-weight: bold;">sum</span>([1 <span style="color: #859900; font-weight: bold;">for</span> y <span style="color: #859900; font-weight: bold;">in</span> student_data[<span style="color: #2aa198;">'passed'</span>] <span style="color: #859900; font-weight: bold;">if</span> y == <span style="color: #2aa198;">'yes'</span>])
<span style="color: #268bd2;">n_failed</span> = <span style="color: #657b83; font-weight: bold;">sum</span>([1 <span style="color: #859900; font-weight: bold;">for</span> n <span style="color: #859900; font-weight: bold;">in</span> student_data[<span style="color: #2aa198;">'passed'</span>] <span style="color: #859900; font-weight: bold;">if</span> n == <span style="color: #2aa198;">'no'</span>])
<span style="color: #268bd2;">grad_rate</span> = 100.*n_passed/(n_passed + n_failed)


tabulate( [[<span style="color: #2aa198;">"Total number of students: "</span>,n_students],
           [<span style="color: #2aa198;">"Number of students who passed: "</span>,n_passed],
           [<span style="color: #2aa198;">"Number of students who failed: "</span>,n_failed],
           [<span style="color: #2aa198;">"Number of features: "</span>,n_features],
           [<span style="color: #2aa198;">"Graduation rate of the class:"</span>,  <span style="color: #2aa198;">"{:.2f}%"</span>.<span style="color: #657b83; font-weight: bold;">format</span>(grad_rate)]], tablefmt=<span style="color: #2aa198;">"grid"</span>)
</pre>
</div>

<p>
This gives us the following figures;
</p>

<!-- This HTML table template is generated by emacs 25.1.1 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;Total&nbsp;number&nbsp;of&nbsp;students:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;395&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;Number&nbsp;of&nbsp;students&nbsp;who&nbsp;passed:&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;265&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;Number&nbsp;of&nbsp;students&nbsp;who&nbsp;failed:&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;130&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;Number&nbsp;of&nbsp;features:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;30&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;Graduation&nbsp;rate&nbsp;of&nbsp;the&nbsp;class:&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;67.09%&nbsp;
    </td>
  </tr>
</table>


<p>
Now we will separate the data into the feature columns and our prediction target, i.e. feature &ldquo;passed&rdquo;.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #268bd2;">feature_cols</span> = <span style="color: #657b83; font-weight: bold;">list</span>(student_data.columns[:-1]) <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">all columns but last are features</span>
<span style="color: #268bd2;">target_col</span> = student_data.columns[-1]          <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">last column is the target/label</span>

<span style="color: #268bd2;">X_all</span> = student_data[feature_cols]             <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">feature values for all students</span>
<span style="color: #268bd2;">y_all</span> = student_data[target_col]               <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">corresponding targets/labels</span>
</pre>
</div>


<p>
Addiontally, we must transform all categorical features into binary/numeric ones in order to be processed
by subsequent algorithms. Pandas&rsquo; <a href="http://pandas.pydata.org/pandas-docs/stable/generated/pandas.get_dummies.html?highlight=get_dummies#pandas.get_dummies">get_dummies</a> function will come in handy.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">preprocess_features</span>(X):
    <span style="color: #268bd2;">outX</span> = pd.DataFrame(index=X.index)  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">output dataframe, initially empty</span>
    <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">Check each column</span>
    <span style="color: #859900; font-weight: bold;">for</span> col, col_data <span style="color: #859900; font-weight: bold;">in</span> X.iteritems():
        <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">Change the data type for yes/no columns to int</span>
        <span style="color: #859900; font-weight: bold;">if</span> col_data.dtype == <span style="color: #657b83; font-weight: bold;">object</span>:
            <span style="color: #268bd2;">col_data</span> = col_data.replace([<span style="color: #2aa198;">'yes'</span>, <span style="color: #2aa198;">'no'</span>], [1, 0])
        <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">For other categories convert to one or more dummy variables</span>
        <span style="color: #859900; font-weight: bold;">if</span> col_data.dtype == <span style="color: #657b83; font-weight: bold;">object</span>:
            <span style="color: #268bd2;">col_data</span> = pd.get_dummies(col_data, prefix=col)  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">e.g. 'school' =&gt; 'school_GP', 'school_MS'</span>
        <span style="color: #268bd2;">outX</span> = outX.join(col_data)  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">collect column(s) in output dataframe</span>
    <span style="color: #859900; font-weight: bold;">return</span> outX
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #268bd2;">X_all</span> = preprocess_features(X_all)
</pre>
</div>

<p>
Now we are ready to split the data into training and test sets. Approximately 75% of the data will be used
for training. This will leave  300 training samples and 95 test samples. We will employ Sci-kit learn&rsquo;s 
train_test_split function to perform the data split.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900; font-weight: bold;">from</span> sklearn.model_selection <span style="color: #859900; font-weight: bold;">import</span> train_test_split
<span style="color: #268bd2;">X_train</span>, <span style="color: #268bd2;">X_test</span>, <span style="color: #268bd2;">y_train</span>, <span style="color: #268bd2;">y_test</span> = train_test_split(
    X_all, y_all, test_size = .24, random_state = 0)
<span style="color: #2aa198;">"Training set: {} samples"</span>.<span style="color: #657b83; font-weight: bold;">format</span>(X_train.shape[0]), <span style="color: #2aa198;">"Test set: {} samples"</span>.<span style="color: #657b83; font-weight: bold;">format</span>(X_test.shape[0])
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
